print("Hello World!")

# В R нет команды для объявления переменной. Переменная создается в тот момент, 
# когда вы впервые присваиваете ей значение.Чтобы присвоить значение переменной, 
# используйте знак  <- 
# Чтобы вывести (или напечатать) значение переменной, просто введите имя переменной:

name <- "John"
print(name)

age <- 40
print(age)


# В "R" вам не нужно использовать функцию для печати/вывода переменных. print()--- paste()
# Вы можете просто ввести имя переменной:
name <- "John Doe"
print(name)

