# Вы также можете объединить или соединить два или более элементов, 
# используя функцию paste().
# Чтобы объединить текст и переменную, R использует запятую ( ,):
text <- "awe"
print(paste("R is", text))

# Для чисел этот + символ работает как математический оператор
# Вы можете просто ввести имя переменной:
num1 <- 5
num2 <- 10
print(num1 + num2)

# В "R" вам не нужно использовать функцию для печати/вывода переменных. print(). paste()
text1 <- "R is"
text2 <- "awesome"
print(paste(text1, text2))

